app/Controllers/Dashboard.php

    public function listSupplier()
    {
        $builder = $this->db->table('tblsupplier a');
        $builder->select('a.supplierName,FORMAT(count(inventID),0)total');
        $builder->join('tblinventory b','b.supplierID=a.supplierID','LEFT');
        $builder->groupBy('a.supplierID')->orderby('total','DESC')->limit(10);
        $data = $builder->get();
---
SELECT `a`.`supplierName`, FORMAT(count(inventID), 0)total
FROM `tblsupplier` `a`
LEFT JOIN `tblinventory` `b` ON `b`.`supplierID`=`a`.`supplierID`
GROUP BY `a`.`supplierID`
ORDER BY `total` DESC
 LIMIT 10

    public function outofStock()
    {
        $builder = $this->db->table('tblinventory a');
        $builder->select('a.*,b.categoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->WHERE('a.Qty',0);
        $data = $builder->get();
---
SELECT `a`.*, `b`.`categoryName`
FROM `tblinventory` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
WHERE `a`.`Qty` = 0

    public function totalVoid()
    {
        $builder = $this->db->table('tblinventory');
        $builder->select('FORMAT(COUNT(*),0)total');
        $builder->WHERE('Qty',0);
        $data = $builder->get();
---
SELECT FORMAT(COUNT(*), 0)total
FROM `tblinventory`
WHERE `Qty` = 0

    public function totalReserved()
    {
        $builder = $this->db->table('tblreserved');
        $builder->select('FORMAT(SUM(Qty),0)total');
        $builder->WHERE('Status','Hold');
        $data = $builder->get();
---
SELECT FORMAT(IFNULL(SUM(Qty), 0), 0)total
FROM `tblreserved`
WHERE `Status` = 'Hold'

    public function overhaulItem()
    {
        $location = session()->get('assignment');
        $builder = $this->db->table('tblrepairreport a');
        $builder->select('FORMAT(COUNT(a.rrID),0)total');
        $builder->join('tbldamagereport b','b.reportID=a.reportID','LEFT');
        $builder->join('tblinventory c','c.inventID=b.inventID','LEFT');
        $builder->WHERE('a.Status',0)->WHERE('c.warehouseID',$location);
        $data = $builder->get();
---
SELECT FORMAT(COUNT(a.rrID), 0)total
FROM `tblrepairreport` `a`
LEFT JOIN `tbldamagereport` `b` ON `b`.`reportID`=`a`.`reportID`
LEFT JOIN `tblinventory` `c` ON `c`.`inventID`=`b`.`inventID`
WHERE `a`.`Status` = 0
AND `c`.`warehouseID` = '1'