app/Controllers/Dashboard.php

    public function listSupplier()
    {
        $builder = $this->db->table('tblsupplier a');
        $builder->select('a.supplierName,FORMAT(count(inventID),0)total');
        $builder->join('tblinventory b','b.supplierID=a.supplierID','LEFT');
        $builder->groupBy('a.supplierID')->orderby('total','DESC')->limit(10);
        $data = $builder->get();
---
SELECT `a`.`supplierName`, FORMAT(count(inventID), 0)total
FROM `tblsupplier` `a`
LEFT JOIN `tblinventory` `b` ON `b`.`supplierID`=`a`.`supplierID`
GROUP BY `a`.`supplierID`
ORDER BY `total` DESC
 LIMIT 10

    public function transferItem()
    {
        $builder = $this->db->table('tbltransfer_request');
        $builder->select('FORMAT(COUNT(requestID),0)total');
        $builder->WHERE('Status',0);
        $data = $builder->get();
---
SELECT FORMAT(COUNT(requestID), 0)total
FROM `tbltransfer_request`
WHERE `Status` = 0