app/Controllers/Home.php

SELECT *
FROM `tblsupplier`
SELECT *
FROM `tblwarehouse`
---
    public function receiveOrder()
    {
        $builder = $this->db->table('tblsupplier');
        $builder->select('*');
        $vendor = $builder->get()->getResult();
        //warehouse
        $builder = $this->db->table('tblwarehouse');
        $builder->select('*');
        $warehouse = $builder->get()->getResult();

SELECT *
FROM `tblprf`
WHERE `OrderNo` = 'PRF-0000005'
 LIMIT 1
---
    public function approver()
    {
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblreview a');
        $builder->select('a.reviewID,a.OrderNo,a.DateReceived,a.DateApproved,a.Status,b.Reason,b.DateNeeded,b.PurchaseType,c.Fullname');
        $builder->join('tblprf b','b.OrderNo=a.OrderNo','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $builder->groupBy('a.reviewID');
        $review = $builder->get()->getResult();
        //assignment
        $builder = $this->db->table('tblprf a');
        $builder->select('a.prfID,a.DatePrepared,a.Department,a.Reason,a.DateNeeded,a.OrderNo,c.Fullname,b.Status');
        $builder->join('tblassignment b','b.prfID=a.prfID','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->WHERE('a.Status',3)->WHERE('PurchaseType','Regular Purchase');
        $assign = $builder->get()->getResult();
        //account
        $builder = $this->db->table('tblaccount');
        $builder->select('*');
        $builder->WHERE('systemRole','Staff');
        $account = $builder->get()->getResult();
        //purchase order
        $builder = $this->db->table('tblpurchase_review a');
        $builder->select('a.prID,a.DateReceived,a.Status,a.purchaseNumber,a.DateApproved,c.Supplier,c.Price');
        $builder->join('tblpurchase_logs b','b.purchaseNumber=a.purchaseNumber','LEFT');
        $builder->join('tblcanvass_sheet c','c.canvassID=b.canvassID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $builder->groupBy('a.prID');
        $purchase = $builder->get()->getResult();

SELECT *
FROM `tblcanvass_form`
WHERE `Reference` = 'CS0000001'
 LIMIT 1
---
    public function canvassRequest()
    {
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblcanvass_review a');
        $builder->select('a.DateReceived,a.Reference,b.DateNeeded,b.Department,a.Status,c.Fullname,b.OrderNo,a.accountID');
        $builder->join('tblcanvass_form b','b.Reference=a.Reference','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $builder->groupBy('a.crID')->orderby('a.crID','DESC');
        $list = $builder->get()->getResult();
        //account
        $builder = $this->db->table('tblaccount');
        $builder->select('*');
        $builder->WHERE('systemRole','Staff');
        $account = $builder->get()->getResult();

SELECT *
FROM `tblaccount`
WHERE `accountID` = '6'
---
    public function localPurchase()
    {
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblcanvass_review a');
        $builder->select('a.DateReceived,a.Reference,b.DateNeeded,b.Department,a.Status,c.Fullname,b.OrderNo,a.accountID');
        $builder->join('tblcanvass_form b','b.Reference=a.Reference','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $builder->groupBy('a.crID')->orderby('a.crID','DESC');
        $list = $builder->get()->getResult();