app/Controllers/Home.php

SELECT `Name`, `industryID`
FROM `tblindustry`
---
    public function suppliers()
    {
        $builder = $this->db->table('tblsupplier a');
        $builder->select('a.*,b.Name');
        $builder->join('tblindustry b','b.industryID=a.industryID','LEFT');
        $record = $builder->get()->getResult();

SELECT `a`.*, `b`.`productName`
FROM `tbldamagereport` `a`
LEFT JOIN `tblinventory` `b` ON `b`.`inventID`=`a`.`inventID`
WHERE `b`.`warehouseID` = '0'
GROUP BY `a`.`reportID`
---
    public function repairReport()
    {
        $assign = session()->get('assignment');
        $builder = $this->db->table('tbldamagereport a');
        $builder->select('a.reportID,b.productName');
        $builder->join('tblinventory b','b.inventID=a.inventID','LEFT');
        $builder->WHERE('b.warehouseID',$assign)->WHERE('a.Status',1);
        $forRepair = $builder->get()->getResult();

SELECT `warehouseID`, `warehouseName`, `Address`
FROM `tblwarehouse`
---
    public function listWarehouse()
    {
        $builder = $this->db->table('tblwarehouse');
        $builder->select('warehouseID,warehouseName,Address');
        $data = $builder->get();

SELECT *
FROM `tblwarehouse`
---
    public function stocksReport()
    {
        if(session()->get('role')=="Administrator"||session()->get('role')=="Editor")
        {
            $builder = $this->db->table('tblwarehouse');
            $builder->select('*');
            $warehouse = $builder->get()->getResult();