app/Controllers/Home.php

    public function receiveOrder()
    {
        $builder = $this->db->table('tblsupplier');
        $builder->select('*');
        $vendor = $builder->get()->getResult();
        //warehouse
        $builder = $this->db->table('tblwarehouse');
        $builder->select('*');
        $warehouse = $builder->get()->getResult();
        //purchase order
        $builder = $this->db->table('tblprf');
        $builder->select('OrderNo');
        $builder->WHERE('Remarks','OPEN')->WHERE('Status',3);
        $order = $builder->get()->getResult();
---
SELECT *
FROM `tblsupplier`
SELECT *
FROM `tblwarehouse`
SELECT `OrderNo`
FROM `tblprf`
WHERE `Remarks` = 'OPEN'
AND `Status` = 3

    public function profile()
    {
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblaccount a');
        $builder->select('a.username,a.Fullname,a.systemRole,a.Status,b.warehouseName,b.Address');
        $builder->join('tblwarehouse b','b.warehouseID=a.warehouseID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $account = $builder->get()->getResult();
---
SELECT `warehouseID`, `warehouseName`, `Address`
FROM `tblwarehouse`

    public function Assign()
    {
        $canvasFormModel = new \App\Models\canvasFormModel();
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblassignment a');
        $builder->select('a.Status,b.prfID,b.OrderNo,b.Remarks,a.Date,b.DateNeeded,b.Reason,b.Department,c.Fullname,a.assignID,e.Fullname as Staff');
        $builder->join('tblprf b','b.prfID=a.prfID','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->join('tblaccount e','e.accountID=a.accountID','LEFT');
        $builder->groupby('a.assignID');
        $list = $builder->get()->getResult();
---
SELECT `a`.`Status`, `b`.`prfID`, `b`.`OrderNo`, `b`.`Remarks`, `a`.`Date`, `b`.`DateNeeded`, `b`.`Reason`, `b`.`Department`, `c`.`Fullname`, `a`.`assignID`, `e`.`Fullname` as `Staff`
FROM `tblassignment` `a`
LEFT JOIN `tblprf` `b` ON `b`.`prfID`=`a`.`prfID`
LEFT JOIN `tblaccount` `c` ON `c`.`accountID`=`b`.`accountID`
LEFT JOIN `tblaccount` `e` ON `e`.`accountID`=`a`.`accountID`
GROUP BY `a`.`assignID`

    public function listOrders()
    {
        $dept = session()->get('department');
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblprf a');
        $builder->select('a.*,b.Comment');
        $builder->join('tblreview b','b.OrderNo=a.OrderNo','LEFT');
        $builder->join('tblaccount c','c.accountID=a.accountID','LEFT');
        $builder->WHERE('c.Department',$dept);
        $builder->groupBy('a.OrderNo');
        $orders = $builder->get()->getResult();
---
SELECT *
FROM `tblprf`
WHERE `OrderNo` = 'PRF-0000001'

    public function Modify($id)
    {
        $builder = $this->db->table('tblcanvass_sheet a');
        $builder->select('a.*,b.Item_Name,b.ItemUnit,b.Qty,b.Specification');
        $builder->join('tbl_order_item b','b.orderID=a.orderID','LEFT');
        $builder->WHERE('a.Remarks','Selected')->WHERE('a.Reference',$id);
        $record = $builder->get()->getResult();
---
SELECT `a`.*, `b`.`Item_Name`, `b`.`ItemUnit`, `b`.`Qty`, `b`.`Specification`
FROM `tblcanvass_sheet` `a`
LEFT JOIN `tbl_order_item` `b` ON `b`.`orderID`=`a`.`orderID`
WHERE `a`.`Remarks` = 'Selected'
AND `a`.`Reference` = 'CS0000009'