app/Controllers/Purchase.php

SELECT *
FROM `tbl_order_item`
WHERE `OrderNo` = 'PRF-0000004'
---
    public function viewOrder()
    {
        $val = $this->request->getGet('value');
        $builder = $this->db->table('tbl_order_item');
        $builder->select('*');
        $builder->WHERE('OrderNo',$val);
        $data = $builder->get();

SELECT `a`.`reviewID`, `a`.`Status`, `b`.`OrderNo`, `b`.`Department`, `b`.`Reason`, `b`.`DateNeeded`, `c`.`Fullname`
FROM `tblreview` `a`
LEFT JOIN `tblprf` `b` ON `b`.`OrderNo`=`a`.`OrderNo`
LEFT JOIN `tblaccount` `c` ON `b`.`accountID`=`c`.`accountID`
WHERE `a`.`reviewID` = '3'
---
    public function viewPurchase()
    {
        $val = $this->request->getGet('value');
        $builder = $this->db->table('tblreview a');
        $builder->select('a.reviewID,a.Status,b.OrderNo,b.Department,b.Reason,b.DateNeeded,c.Fullname');
        $builder->join('tblprf b','b.OrderNo=a.OrderNo','LEFT');
        $builder->join('tblaccount c','b.accountID=c.accountID','LEFT');
        $builder->WHERE('a.reviewID',$val);
        $data = $builder->get();

SELECT *
FROM `tbl_order_item`
WHERE `OrderNo` = 'PRF-0000003'
---
                            <?php
                            $builder = $this->db->table('tbl_order_item');
                            $builder->select('*');
                            $builder->WHERE('OrderNo',$row->OrderNo);

SELECT `Image`
FROM `tblimage`
WHERE `inventID` = '5'
---
    public function viewImage()
    {
        $val = $this->request->getGet('value');
        $builder = $this->db->table('tblimage');
        $builder->select('Image');
        $builder->WHERE('inventID',$val);
        $data = $builder->get();